Repository: benzid-wael/mwareeth
Catalog: locales/*/LC_MESSAGES/mwareeth.po
Languages: ar

source: A person with the name '{name}' already exists
ar: يوجد بالفعل شخص باسم '{name}'

source: Invalid gender: {gender}. Must be 'male' or 'female'
ar: جنس غير صالح: {gender}. يجب أن يكون 'ذكر' أو 'أنثى'

source: A deceased person is already set
ar: تم تعيين شخص متوفى بالفعل

source: Person '{name}' does not exist
ar: الشخص '{name}' غير موجود

source: father
ar: الأب

source: mother
ar: الأم

source: child
ar: الطفل

source: spouse
ar: الزوج/الزوجة

source: Invalid relationship type: {relation}
ar: نوع علاقة غير صالح: {relation}

source: No deceased person is set
ar: لم يتم تعيين شخص متوفى

source: Circular reference detected involving {name}
ar: تم اكتشاف مرجع دائري يتضمن {name}

source: Inconsistent father-child relationship for {name}
ar: علاقة أب-طفل غير متسقة لـ {name}

source: Inconsistent mother-child relationship for {name}
ar: علاقة أم-طفل غير متسقة لـ {name}

source: Inconsistent spousal relationship between {name1} and {name2}
ar: علاقة زوجية غير متسقة بين {name1} و {name2}

source: Invalid family tree: {errors}
ar: شجرة عائلة غير صالحة: {errors}

source: Welcome to the Family Tree Builder!
ar: مرحبًا بك في منشئ شجرة العائلة!

source: Let's start by adding the deceased person (the focal point of the tree).
ar: لنبدأ بإضافة الشخص المتوفى (نقطة محورية للشجرة).

source: Name
ar: الاسم

source: Gender
ar: الجنس

source: Birth year (optional, press Enter to skip)
ar: سنة الميلاد (اختياري، اضغط Enter للتخطي)

source: Death year (optional, press Enter to skip)
ar: سنة الوفاة (اختياري، اضغط Enter للتخطي)

source: Add a person
ar: إضافة شخص

source: Add a relationship
ar: إضافة علاقة

source: Visualize the family tree
ar: عرض شجرة العائلة

source: Finish and build the family tree
ar: إنهاء وبناء شجرة العائلة

source: What would you like to do?
ar: ماذا تريد أن تفعل؟

source: Enter your choice
ar: أدخل اختيارك

source: Invalid choice. Please try again.
ar: اختيار غير صالح. يرجى المحاولة مرة أخرى.

source: Please fix these errors and try again.
ar: يرجى إصلاح هذه الأخطاء والمحاولة مرة أخرى.

source: Adding a new person
ar: إضافة شخص جديد

source: Added {name} to the family tree.
ar: تمت إضافة {name} إلى شجرة العائلة.

source: Adding a new relationship
ar: إضافة علاقة جديدة

source: Available people
ar: الأشخاص المتاحون

source: Enter the name of the first person
ar: أدخل اسم الشخص الأول

source: Relationship types
ar: أنواع العلاقات

source: Enter the name of the {relation}
ar: أدخل اسم {relation}

source: Added {relation} relationship between {person1} and {person2}.
ar: تمت إضافة علاقة {relation} بين {person1} و {person2}.

source: Graphviz is not installed. Please install it to visualize the family tree.
ar: Graphviz غير مثبت. يرجى تثبيته لعرض شجرة العائلة.

source: You can install it with: pip install graphviz
ar: يمكنك تثبيته باستخدام: pip install graphviz

source: You may also need to install the Graphviz system package.
ar: قد تحتاج أيضًا إلى تثبيت حزمة Graphviz للنظام.

source: Pick language:
ar: اختر اللغة:

source: Visualizing the family tree:
ar: عرض شجرة العائلة:

source: Family Tree
ar: شجرة العائلة

# male
source: Born
ar: ولد

# female
source: Born
ar: ولدت

# male
source: Died
ar: توفي

# female
source: Died
ar: توفيت

# male
source: spouse
ar: زوج

# female
source: spouse
ar: زوجة

source: Family tree visualization has been generated and should open automatically.
ar: تم إنشاء عرض شجرة العائلة ويجب أن يفتح تلقائيًا.

source: Could not render the graph. Here's the DOT source:
ar: تعذر عرض الرسم البياني. إليك مصدر DOT:

source: Deceased
ar: المتوفى

source: Ancestors
ar: الأسلاف

source: Grandfathers
ar: الأجداد

source: Grandmothers
ar: الجدات

source: Siblings
ar: الإخوة والأخوات

source: Brothers
ar: الإخوة

source: Sisters
ar: الأخوات

source: Extended Family
ar: العائلة الممتدة

source: Uncles
ar: الأعمام

source: Aunts
ar: العمات

source: Cousins
ar: أبناء العم/العمة

source: Descendants
ar: الأحفاد

source: Sons
ar: الأبناء

source: Grandchildren
ar: الأحفاد

source: Son
ar: ابن

source: Daughter
ar: ابنة

source: Daughters
ar: البنات

source: Mwareeth - Islamic Inheritance Calculator
ar: مواريث - حاسبة الميراث الإسلامية

source: Ready
ar: مستعد

source: New Family Tree
ar: شجرة العائلة جديدة

source: Open...
ar: فتح

source: Save
ar: حفظ

source: Save As...
ar: حفظ باسم...

source: Exit
ar: خروج

source: File
ar: ملف

source: English
ar: إنجليزي

source: Arabic
ar: عربي

source: Language
ar: اختر اللغة

source: About
ar: حول التطبيق

source: Help
ar: مساعدة

source: Family
ar: أسرة

source: Add Person
ar: إضافة شخص

source: Add Relationship
ar: إضافة علاقة

source: People
ar: الأشخاص

source: Set as Deceased
ar: تعيين كمتوفى

source: Refresh
ar: تحديث

source: Inheritance
ar: الميراث

source: Calculate Inheritance
ar: حساب الميراث

source: Error
ar: خطأ

source: Info
ar: معلومات

source: Please select a person first
ar: الرجاء اختيار شخص أولاً

source: Set {name} as the deceased
ar: تعيين {name} كمتوفى

source: Yes
ar: نعم

source: No
ar: لا

source: Family tree visualization refreshed
ar: تم تحديث تصور شجرة الأسرة

source: Error generating graphical representation: {error}
ar: خطأ في إنشاء التمثيل الرسومي: {error}

source: All Files
ar: جميع الملفات

source: Inheritance calculation not yet implemented
ar: لم يتم تنفيذ حساب الميراث بعد!

source: Inheritance calculation completed
ar: تم الانتهاء من حساب الميراث

source: Confirm
ar: توكيد

source: Are you sure you want to create a new family tree? Any unsaved changes will be lost.
ar: هل أنت متأكد من رغبتك في إنشاء شجرة عائلة جديدة؟ ستُفقد أي تغييرات غير محفوظة.

source: Created new family tree
ar: تم إنشاء شجرة عائلة جديدة

source: Open Family Tree
ar: شجرة العائلة

source: JSON Files
ar: ملفات JSON

source: Language changed successfully.
ar: تم تغيير اللغة بنجاح.

source: Failed to change language: {error}
ar: فشل تغيير اللغة: {error}

source: Mwareeth - Islamic Inheritance Calculator A tool to calculate inheritance according to Islamic law.
ar: مواريث - حاسبة الميراث الإسلامية أداة لحساب الميراث وفقًا للشريعة الإسلامية

source: Name:
ar: الاسم

source: Gender:
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Religion:
ar: دِيانة:

source: Birth Year:
ar: سنة الميلاد:

source: Death Year:
ar: سنة الوفاة:

source: Is Deceased
ar: هل هو متوفى؟

source: Person:
ar: :شخص

source: Relationship:
ar: :القرابة

source: Relative:
ar: قريب:
